app/controllers/accounts_controller.rb

  def show
    @current_user = User.find(current_user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]