app/controllers/receive_texts_controller.rb

  def response_message
    from = params[:From]
    body = params[:Body]

    correct_answer = Question.where(body: Question.where(id: Response.where(to_number: from).last.question_id).first.body).first.correct_answer

    explanation = Question.where(body: Question.where(id: Response.where(to_number: from).last.question_id).first.body).first.explanation

    user_response = Response.where(to_number: from).last.user_response

    # user_last_received_question = Question.where(id: Response.where(to_number: from).last.question_id).first.body

    @twiml = Twilio::TwiML::Response.new do |r|
      if body == correct_answer && "1" || body == correct_answer && "2" || body == correct_answer && "3" || body == correct_answer && "4"
          if user_response.nil?
            r.Message "Correct."
            Response.where(to_number: from).last.update_attributes(user_response: body, response_status: "Correct")
---
SELECT  "responses".* FROM "responses" WHERE "responses"."to_number" = ?  ORDER BY "responses"."id" DESC LIMIT 1  [["to_number", "+19174179542"]]
UPDATE "responses" SET "user_response" = ?, "response_status" = ?, "updated_at" = ? WHERE "responses"."id" = ?  [["user_response", "1"], ["response_status", "Wrong"], ["updated_at", "2016-04-16 18:35:28.992835"], ["id", 92]]